views/requests/_form.php


    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'ship_id')->dropDownList(ArrayHelper::map(Ships::find()->all(), 'id', 'name'),
    ['prompt' => 'Тип транспорта']) ?>

    <?= $form->field($model, 'startdate')->input('datetime-local') ?>

    <?= $form->field($model, 'payment_id')->dropDownList( ArrayHelper::map(Payments::find()->all(), 'id', 'name'),
    ['prompt' => 'Тип оплаты']
    ) ?>
---
SELECT * FROM `ships`
SELECT * FROM `payments`

    <?

    if(Yii::$app->user->identity->isadmin === 1) {
        echo $form->field($model, 'status_id')->dropDownList( ArrayHelper::map(Statuses::find()->all(), 'id', 'name'));
---
SELECT * FROM `statuses`