views/requests/index.php

SELECT * FROM `payments` WHERE `id`=1
SELECT * FROM `ships` WHERE `id`=2
SELECT * FROM `users` WHERE `id`=12
SELECT * FROM `ships`
SELECT * FROM `payments`
SELECT * FROM `users`
---

    <?php // echo $this->render('_search', ['model' => $searchModel]); ?>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],
            [
                "attribute" => 'ship_id',
                "value" => 'ship.name',
                "filter" => ArrayHelper::map(Ships::find()->all(), 'id', 'name')
            ],
            'startdate',
            [
                "attribute" => 'payment_id',
                "value" => 'payment.name',
                "filter" => ArrayHelper::map(Payments::find()->all(), 'id', 'name')
            ],
            [
                "attribute" => 'user_id',
                "value" => 'user.fullname',
                "filter" => ArrayHelper::map(User::find()->all(), 'id', 'fullname')
            ],
            //'status_id',

            ['class' => 'yii\grid\ActionColumn'],