controllers/RequestsController.php

INSERT INTO `requests` (`ship_id`, `startdate`, `payment_id`, `status_id`, `user_id`) VALUES (1, '2026-05-15T18:08', 2, 1, 1)
---
    public function actionCreate()
    {
        $model = new Requests();

        if(Yii::$app->user->isGuest) {
            Yii::$app->session->setFlash('warning', 'Для создания заявки, необходима регистрация');
            return $this->redirect(['/site/login']);
        }

            // УСЛОВИЕ СРАБАТЫВАЕТ ПРИ ОТПРАВКИ ФОРМЫ
            if ($this->request->isPost) {

                if ($model->load($this->request->post())) {

                    $model->user_id = Yii::$app->user->identity->id;
                    // Yii::$app->user->identity->isadmin === 1

                    if($model->save()){

SELECT * FROM `requests` WHERE `id`='6'
---
    protected function findModel($id)
    {
        if (($model = Requests::findOne($id)) !== null) {